#   MFM - VIP

from userbot.Config import Config # Ok - 🖤 

USERID = Config.OWNER_ID
Name = Config.ALIVE_NAME
DEFAULTUSER = str(Name) if Name else "TOKYO"
mention = f"[{Name}](tg://user?id={USERID})"

Plugin = "userbot/plugins/{}.py"
Admin = "userbot/plugins/Admin/{}.py"
Animation = "userbot/plugins/animations/{}.py"
Tosh = "userbot/plugins/tosha/{}.py"
Assistant = "userbot/plugins/assistant/{}.py"
AssistantPm = "userbot/plugins/assistant/PmTosh/{}.py"

Xtbot = "\"TG_BOT_TOKEN\""
Xt = "TG_BOT_TOKEN"
Xe = "STRING_SESSION"

A = Config.APP_ID
H = Config.API_HASH
B = Config.TG_BOT_TOKEN
N = Config.NO_LOAD

Start = (
    """
    <------------------------------------>
         يتم تحميل ملفات السورس طوكيو
    <------------------------------------>
    """
)

TOSHA = Config.PRIVATE_GROUP_BOT_API_ID
TBOT = Config.TG_BOT_USERNAME
T = Config.COMMAND_HAND_LER or "."
DEVL = "@MFMVIP"

C = "**✘ ∫ المعادله ⪼** {}\n  **- الحل ⪼** {}"
Calc = (
    "𓆰 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - 𝑪𝑨𝑳𝑪𝑼𝑳𝑨𝑻𝑶𝑹 𓆪\n"
    "ٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n"
    "**✘ ∫ قائـمه اوامر الحاسبه :** \n"
    "⪼ `.حاسبه` + المعادله \n"
    "ٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n"
    "𓆩 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - [𝙈𝙐𝙎𝙏𝘼𝙁𝘼](t.me/MFMVIP) 𓆪"
)

kk = [
   "╭━━━╮\n┃╭━━╯\n┃╰━━╮\n┃╭━━╯\n┃┃\n╰╯",
   "┏━━━┓\n┃┏━━┛\n┃┗━━┓\n┃┏━━┛\n┃┃\n┗┛"
]

urs = "**✘ ∫ نسبة نجاحك هيه -** {}"
Fl = [
   "+100% 🔱🖤", "100% 🖤", "95%", "90%","85%", "80%", "75%", "70%", "65%", "60%", "55%", 
   "50%", "45%", "40%", "35%", "30%", "25%", "20%", "15%", "10%", "0%", "-0%"
]

MSGE = (
   f"𓆰 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\nٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n**✘ ∫ المستخدم -** {mention}\n**✘ ∫ البوت - {TBOT}**\n**✘ ∫ للمساعده - {DEVL}**\n**اكتب {T}بنك لتحقق اذا ما كان البوت يعمل**"
)

Tlk = " تم استرداد ⫸"
IS = "⫷ لايمكن تحميل - {} بسبب {} ⫸"

#- TOSH is the most beautiful girl in the world -#
ICSJ = "<ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ>"
StartLoaded = "<ⵧⵧⵧⵧⵧⵧ⫷ - MFM PLUGINS - ⫸ⵧⵧⵧⵧⵧⵧ>"
ASSISTANT = "<ⵧⵧⵧⵧⵧⵧ⫷ - MFM ASSISTANT - ⫸ⵧⵧⵧⵧⵧⵧ>"
KIMOTOSHA = "<ⵧⵧⵧⵧⵧⵧⵧⵧ⫷ - MFM TOSHA - ⫸ⵧⵧⵧⵧⵧⵧⵧ>"
ANIMATIONS = "<ⵧⵧⵧⵧⵧⵧ⫷ - MFM ANIMATIONS - ⫸ⵧⵧⵧⵧⵧ>"
ADMIN = "<ⵧⵧⵧⵧⵧ⫷ - MFM ADMIN TOOLS - ⫸ⵧⵧⵧⵧⵧ>"
ASSISTANTPM = "<ⵧⵧⵧⵧⵧ⫷ - MFM ASSISTANT PM - ⫸ⵧⵧⵧⵧⵧ>"
ICSW = "<ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ>"
# --- MESSI IS THE BEST PLAYER IN THE WORLD --- #

Plg = "userbot/plugins/*.py"
Adm = "userbot/plugins/Admin/*.py"
Inm = "userbot/plugins/animations/*.py"
Tsh = "userbot/plugins/tosha/*.py"
Ast = "userbot/plugins/assistant/*.py"
Pmt = "userbot/plugins/assistant/PmTosh/*.py"

Message = (
"""       ⫷ بوت طوكيو يعمل بنجاح الان ⫸
   ⫷ المستخدم: {} - البوت: {} ⫸
⫷ @MFMVIP - اذا كنت بحاجه الى مساعده فتوجه الى ⫸"""
)

Mesg = [
    '⫷ يتم تحميل انلاين طوكيو ⫸',
    '⫷ اكتمل تنزيل انلاين طوكيو بدون اخطاء ⫸',
    '⫷ يتم بدء بوت طوكيو ⫸',
    '⫷ اكتمل بدء بوت طوكيو ⫸'
]

Quotly = [
    '**✘ ∫ اهلا -** {} **قم برد على الرساله**',
    '**✘ ∫ اهلا -** {} **التنسيق غير مدعوم**',
    '**✘ ∫ جاري المعـالجه….**',
    '**✘ ∫ قم بالرد على الرساله او قم بوضع النص قرب الامر**',
    '**✘ ∫ اهلا -** {} **خطا في بناء الامر**',
    '**✘ ∫ يرجى الغاء الحظر من البوت ~** @quotlybot'
]

Cmds = "𓆰 [𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - 𝘾𝙊𝙈𝙈𝘼𝙉𝘿𝙎 ](t.me/MFMVIP) 𓆪\nٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n**✘ ∫ اهلاً بك عزيزي اختر الاوامر الاتيه :**\n **م1   ➪ اوامر الادمن** \n **م2   ➪ اوامر التسليه**\n **م3   ➪ اوامر الترحيب**\n **م4   ➪ اوامر الردود**\n **م5   ➪ اوامر الرفع**\n **م6   ➪ اوامر الحمايه**\n **م7   ➪ اوامر التلكراف**\n **م8   ➪ اوامر الملصقات**\n **م9   ➪ اوامر التاك**\n **م10 ➪ اوامر الكشف**\n **م11 ➪ اوامر المجموعه**\n **م12 ➪ اوامر الترجمه**\n **م13 ➪ اوامر البحث**\n **م14 ➪ اوامر الانتحال**\n **م15 ➪ اوامر النت**\n **م16 ➪ اوامر البوت**\n **م17 ➪ اوامر الحساب**\n **م18 ➪ اوامر السورس**\n **م19 ➪ اوامر الزغـرفه**\n **م20 ➪ اوامر المتحركات**\n **م21 ➪ اوامر الهمسه**\n **م22 ➪ اوامر الالعاب**\n **م23 ➪ اوامر الحاسبه**\n **م24 ➪ اوامر هيروكو**\n **م25 ➪ اوامر الوقتـي**\n **م26 ➪ اوامر القائمة السوداء**\n **م27 ➪ اوامر التحـويلات**\n **م28 ➪ اوامر الكـشف العـام**\n ٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n 𓆩[𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤](t.me/TOKYO_TEAM)𓆪\n 𓆩[𝙈𝙐𝙎𝙏𝘼𝙁𝘼](t.me/MFMVIP)𓆪"

# Help String - Text when u type .help!
HelpString = "𓆩 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - **قائمـة المساعـده** 𓆪\nٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n**✘ ∫ اهلا بك عزيزي {} في قائمه الانلاين:**\n\n**⪼ استخدم** `.مساعده واسم الاضافه`\n**لاضهار الاوامر بدون الاستخدام.**\n\n**⪼ استخدم** `.شرح واسم الاضافه`\n**لاضهار الاوامر وطريقه استخدامها وفوائدها**\n ٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n 𓆩[𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤](t.me/TOKYO_TEAM)𓆪\n 𓆩[𝙈𝙐𝙎𝙏𝘼𝙁𝘼](t.me/MFMVIP)𓆪"

# For Dev:
Devt = "𓄂╺  𝑫𝑬𝑽 𝑼𝑺𝑬𝑹\n╰──► {} ༗".format(DEVL)

# For Echo - EchoText:
Echo = [
    '**✘ ∫ اهلا -** {}\n**✘ ∫ انه موجود بلفعل في قائمه الازعاج**',
    '**✘ ∫ هها هلو 🤍🎧 ،**',
    '**✘ ∫ اهلا -** {} \n**✘ ∫ قم برد على الرساله لكي تتم اضافته الى قائمه الازعاج**',
    '**✘ ∫ اهلا -** {} \n**✘ ∫ تم ايقاف امر الازعاج**',
    '**✘ ∫ اهلا -** {} \n**✘ ∫ هذا المستخدم غير مضاف الى قائمه الازعاج**',
    '𓆩 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - 𝑬𝑪𝑯𝑶 𝑳𝑰𝑺𝑻 𓆪\nٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n**✘ ∫ قائمة المضافين للازعاج:**\n',
    '**- ايدي المستخدم :** `{}`\n**- ايدي الـمجموعه :** `{}`\n\n',
    '**✘ ∫ اهلا - {} \n**✘ ∫ لم تقم باضافه احد للقائمه**'
]
