from userbot.Config import Config # Ok
# for update code when i need it
HEROKU_APP_NAME = Config.HEROKU_APP_NAME or None
HEROKU_API_KEY = Config.HEROKU_API_KEY or None
UPSTREAM_REPO_BRANCH = Config.UPSTREAM_REPO_BRANCH
UPSTREAM_REPO = "https://github.com/MFMVIP/TOKYO"
T = Config.COMMAND_HAND_LER

Up_1 = "𓆰 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n ٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n** ⪼ يوجـد تحـديث جديد لسورس طوكيو ༗.**\n`{}`\n ٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n 𓆰 𝙎𝙊𝙐𝙍𝘾𝞝 𝘿𝙀𝙑 - @MFMVIP 𓆪"
Up_2 = "**تنصيب تحديث طوكيو قيد التقدم ، يرجى الانتظار حتى تنتهي العملية ، وعادة ما يستغرق التحديث من 4 إلى 5 دقائق.**"
Up_3 = "𓆰 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\nٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n**⪼ تم التحديث بنجاح ✅**\n ** جارٍ إعادة تشغيل بوت طوكيو ، انتظر 𓆰.**"
Up_4 = "𓆰 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n ٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n**⪼ جاري البحث عن التحديثات  🌐.. 𓆰،**"
Up_5 = "𓆰 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\nٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n**⪼ يتم تنصيب التحديث  انتظر 🌐 𓆰،**"
Up_6 = "𓆰 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n ٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n**⪼ يتم تحديث بوت طوكيو انتظر 🌐..𓆰،**"

Upeor_1 = "بيانات اعتماد هيروكو غير صالحة لتنصيب طوكيو"
Upeor_2 = "`عفوًا .. لا يمكن لبرنامج التحديث المتابعة بسبب "
Upeor_3 = "حدثت بعض المشاكل`\n\n**تتبع السجل:**\n"
Upeor_4 = "𓆰 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n ٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n** ⪼ اضبط المتغيرات المطلوبة أولاً لتحديث بوت طوكيو 𓆰،**",

Upend = "\n𓆰 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\nٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n**⪼ سورس طوكيو محدث لأخر اصدار ༗. **"
UpMsg =  f"𓆰 𝙎𝙤𝙪𝙧𝙘𝙚 𝙏𝙤𝙠𝙔𝙤 - 𝑼𝑷𝑫𝑨𝑻𝑬 𝑴𝑺𝑮 𓆪\n ٴ⊶─────≺ᴛᴏᴋʏᴏ≻─────⊷\n⪼ اضغط هنا **للتحديث السريع ↫ **[`{T}تحديث الان`] او اضغط هنا **لتنصيب التحديث** وقد يستغرق 5 دقائق ↫ [`{T}تحديث البوت`]"
